ЭкзаменационнаяЗадача/src/Documents/ОплатаПоставщику/ОплатаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику</name>
  <basedOn>Document.ПоступлениеКниг</basedOn>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПоступившихКниг</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/Documents/ОплатаПоставщику/Forms/ФормаДокумента/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Приемщик);
		Объект.ТекущийКурс = 1;
		Объект.Валюта = Справочники.Валюты.РоссийскийРубль;
		
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТекущийКурс = Неопределено Или
		Объект.ТекущийКурс = 0 Тогда
		Сообщить("Задайте курс валюты!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ТекущаяВалюта = Объект.Валюта;
	Объект.ТекущийКурс = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
	
	Если Объект.ТекущийКурс = Неопределено 
		Или Объект.ТекущийКурс = 0 Тогда
		
		Сообщить("Задайте курс валюты");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.Валюта);
		ОткрытьФорму("Справочник.Валюты.Форма.ФормаЭлемента_Управляемая", ПараметрыФормы);
		Возврат;
		
	КонецЕсли;
	
	Если Не Объект.СписокКниг.Количество() = 0 Тогда
	
		РасчитатьСумму();
	
	КонецЕсли;
	
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки(); 
	
	Элементы.СписокКниг.ТекущиеДанные.РозничнаяЦена = ЦенаПоставщика * (1 + ПроцентНаценки / 100);
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	Количество = Элементы.СписокКниг.ТекущиеДанные.Количество;
	
	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
		Возврат;
	КонецЕсли;
	 
	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма") * Объект.ТекущийКурс;
	
КонецПроцедуры






#КонецОбласти
